{
    "seen_entries": [
        {
            "id": 1,
            "title": "Zelenskyy due to meet Capitol Hill leaders amid GOP criticism",
            "link": "https://www.politico.com/live-updates/2024/09/26/congress/zelenskyy-to-the-hill-00181146",
            "published": "Thu, 26 Sep 2024 07:44:58 EST",
            "content": "Many lawmakers left Washington on Wednesday evening after funding the government through Dec. 20, but a bipartisan group of senators is due to meet Thursday morning with Ukrainian President Volodymyr Zelenskyy on Capitol Hill. \nThe session will include Senate Majority Leader Chuck Schumer and Minority Leader Mitch McConnell. Zelenskyy will meet with other top officials separately, like House Minority Leader Hakeem Jeffries and House Foreign Affairs ranking member Gregory Meeks (D-N.Y.). \nThe timing is delicate for Zelenskyy, as he faces GOP criticism over comments in which he called Republican vice presidential nominee Sen. JD Vance (Ohio) “too extreme” and investigations of a Pennsylvania weapons factory visit. \nZelenskyy is trying to shore up support and sell Washington on his strategy for victory in the conflict with Russia. For now, many lawmakers say the Ukrainian leader seems to have what he needs to keep up the fight. “Right now, he said he has what he needs,” said Sen. Chris Murphy (D-Conn.), who met with Zelenskyy earlier in the week. \nSenate floor recap: Schumer announced the next Senate vote would be Nov. 12 — and moved to end debate on two more judicial nominees. (Two judges for federal tax courts were confirmed by voice vote.) \nIn addition, senators cleared a bill renaming a federal building in San Francisco after the late Sen. Dianne Feinstein (D-Calif.)."
        },
        {
            "id": 2,
            "title": "AOC says Eric Adams should resign",
            "link": "https://www.politico.com/video/2024/09/26/aoc-says-eric-adams-should-resign-1448109",
            "published": "Thu, 26 Sep 2024 09:36:00 EST",
            "content": "AOC says Eric Adams should resign \nlead image"
        },
        {
            "id": 3,
            "title": "Tlaib calls on Blinken to resign over statements related to Israel-Hamas war",
            "link": "https://www.politico.com/live-updates/2024/09/26/congress/tlaib-calls-on-blinken-to-resign-00181168",
            "published": "Thu, 26 Sep 2024 10:03:22 EST",
            "content": "Rep. Rashida Tlaib called on Secretary of State Antony Blinken to resign in a Thursday social media post, citing a ProPublica story alleging he had rejected internal government findings about Israel blocking aid to Gaza.  \n\"[Blinken] lied. People went hungry, and some died. He needs to resign now,\" she wrote on X. Tlaib, a progressive and the only Palestinian American in Congress, has been a vocal critic of the U.S. government's policy towards Israel.  \nProPublica reported earlier this week that Blinken had delivered a toned-down message to Congress in May that had contradicted internal government findings that Israel had blocked deliveries of humanitarian aid into Gaza amid the Israel-Hamas war. The internal findings, ProPublica reported, could have implications for U.S. military aid to Israel because of U.S. laws — which require an end to weapons shipments to countries that block U.S.-backed humanitarian aid.  \nThe State Department did not immediately respond to a request for comment. "
        },
        {
            "id": 4,
            "title": "House Democrats likely to force action on measure formally reprimanding Clay Higgins",
            "link": "https://www.politico.com/live-updates/2024/09/26/congress/dems-seek-censure-of-clay-higgins-00181204",
            "published": "Thu, 26 Sep 2024 12:31:26 EST",
            "content": "Rep. Clay Higgins (R-La.) infuriated many of his House colleagues with his since-deleted racist X post about Haitian migrants, prompting a top Black Democrat to introduce a measure to formally reprimand him that will likely see a floor vote. \nCongressional Black Caucus Chair Rep. Steven Horsford (D-Nev.) is expected to force action on the censure resolution when the House returns after the November election. Disciplinary measures like censure can be “privileged,” meaning they can bypass committee on a fast track to the House floor. \nAnd while it is unclear how many Republicans would back the resolution, at least one House Republican told POLITICO they plan to support it. Others said they were flabbergasted that Higgins refused to admit fault and that Speaker Mike Johnson side-stepped a public reprimand. \nWhile Congressional Black Caucus members — and House Democrats, broadly — have voiced anger with Higgins’ social media language, the House can’t act on the censure resolution while the chamber is out of session. It’s also unclear if Democrats are going to use the post in the final month of the campaign to tie his words to other Republicans or make the post a campaign issue more broadly. \nBut Democrats still say they are incensed and want to seek punishment for him in Congress. Congressional Progressive Caucus Chair Pramila Jayapal (D-Wash.) urged the bloc to support the censure against Higgins. \n“We urge all of our colleagues in Congress to support the Congressional Black Caucus’ resolution censuring Representative Higgins and holding him accountable for his dangerous comments when the House returns in November,” she said in a statement. \nHiggins had written a now-deleted post on the platform X — using his official congressional account — that called Haitians \"wild\" and added: \"Eating pets, vudu, nastiest country in the western hemisphere, cults, slapstick gangster ... but damned if they don't feel all sophisticated now, filing charges against our President and VP. All these thugs better get their mind right and their ass out of our country before January 20th.\" \nHe later doubled down that “it’s all true,” when asked by CNN about his now-deleted post. When asked for comment, Higgins' office pointed to comments to reporters Thursday morning where Higgins said \"you never want to intentionally hurt someone's feelings\" and said the post was \"intended for Haitian gangs. I mean Haiti is a country, not a color.\" \nHiggins, who hails from the same state as the top two Republicans in House leadership, has seen a series of promotions with Johnson holding the gavel, including being named a GOP impeachment manager and a member of the highly-sought after Trump assassination task force, among other leadership nods. \nIf the effort falters when the House returns, Democrats might resurface it or find other ways to punish Higgins if control of the House flips. House censures have become more common in recent years. House Democrats censured Rep. Paul Gosar (R-Ariz.) last Congress after he posted an anime video depicting him committing violence against Democrats, and Republicans issued the formal reprimand to Reps. Rashida Tlaib (D-Mich.), Adam Schiff (D-Calif.) and Jamaal Bowman (D-N.Y.) this Congress."
        },
        {
            "id": 5,
            "title": "Gaetz says he will no longer voluntarily cooperate with House Ethics probe",
            "link": "https://www.politico.com/live-updates/2024/09/26/congress/gaetz-done-with-ethics-probe-00181219",
            "published": "Thu, 26 Sep 2024 12:44:10 EST",
            "content": "Rep. Matt Gaetz (R-Fla.) said Thursday he will no longer voluntarily cooperate with a House Ethics Committee investigation into his conduct, calling the probe “uncomfortably nosey.” \nIn a lengthy letter to the committee posted&nbsp;to social media platform X, Gaetz said he's aware of a subpoena from the committee but that it has not yet been served to him. He “unequivocally” denied sexual activity with anyone under the age of 18 and said he had \"not used drugs which are illegal, absent some law allowing use in a jurisdiction of the United States.” \nGaetz has denied wrongdoing. The Justice Department conducted its own investigation as part of a sex trafficking probe and, according to Gaetz’s lawyers and DOJ officials, decided not to bring criminal charges. \nThe lawmaker said the investigation seeks to remove him from office and smear his name. “Asking about my sexual history as a single man with adult women is a bridge too far,” he said. \nGaetz is an outspoken supporter of former President Donald Trump and represents a deep red seat in northwest Florida."
        },
        {
            "id": 6,
            "title": "Trump shooting task force emphasizes Secret Service failures in first hearing",
            "link": "https://www.politico.com/live-updates/2024/09/26/congress/secret-service-failures-trump-shooting-task-force-00181240",
            "published": "Thu, 26 Sep 2024 13:26:13 EST",
            "content": "The Secret Service didn’t testify Thursday before a House task force investigating the two assassination attempts against former President Donald Trump. But it’s the main focus of the panel’s first public hearing. \nThe House panel used a hearing with state and local law enforcement, as well as a former Secret Service official, to drill down into the decisions made in the lead up to and during the July 13 shooting at Trump’s rally in Butler, Pennsylvania. \nRep. Mike Kelly (R-Pa.) set the tone during his opening statement, saying the shooting was not prevented “because of failures by the Secret Service.” \n“The Secret Service was not assertive on key decisions,” Kelly said, comparing communications and messages through the various layers of law enforcement to “the old children’s game, telephone.” \nState and local law enforcement officials described a lack of communication and guidance from the Secret Service, and said the agency appeared to lack key resources during the event. John Herold, who is with the Pennsylvania State Police, contrasted the resources for a Trump 2020 rally with the event earlier this year. \n“The Secret Service did not have a lot of the resources that were in Butler for 2020, and this event on July 13 they seemed like they had a lot less resources,” Herold said. \nThe task force heard from two other local law enforcement officials who were in Butler on July 13: Drew Blasko and Edward Lenz, as well as Ariel Goldschmidt, the Allegheny County medical examiner, and Patrick Sullivan, a former Secret Service agent. \nThe officials were grilled on what communications they had with the Secret Service ahead of the rally. Both Lenz and Herold told the panel that they did a walk through of the rally site with the Secret Service in advance of July 13. The agency did not bring up how to secure the building where the gunman, Thomas Crooks, was able to access the roof, the witnesses said. \nLenz also told the committee that local law enforcement snipers didn’t receive guidance from the Secret Service about how to cover the building where the gunman ultimately was, and that he did not believe Secret Service agents could hear their radio communications on that day. The law enforcement officials also told the committee that they were not made aware of foreign threats against Trump, a reference to Iranian assassination threats. \nLenz also told the committee that, at 6:11 p.m., he ordered a quick-reaction force to deploy to the building where the gunman was and, prior to finishing that transmission, “you can hear the shots being fired through my open microphone.” \nThe task force has until mid-December to wrap up its work and issue a report on its findings and recommendations to prevent future violence against candidates. Its purview now also includes the second attempted assassination against Trump in West Palm Beach, Florida. The task force was expected to travel to Florida on Friday but the trip was canceled as the state braces for Hurricane Helene. \nThe hearing comes a day after a Senate committee released an interim report that found sweeping errors by the Secret Service in the lead up to and during the July 13 rally. \nReps. Eli Crane (R-Ariz.) and Cory Mills (R-Fla.) also testified to the committee on Thursday. The two GOP lawmakers have been part of a group of House Republicans who have been running their own investigation into the July 13 shooting after they weren’t tapped by leadership to join the task force. Unlike the task force, they do not have subpoena power, but said they would share any information they get with the House panel. \nCrane, during his statement, said that they believe then-Secret Service Director Kimberly Cheatle lied when she testified before Congress earlier this year about why law enforcement was not placed on the roof, where Crooks ultimately fired his shots. \nCrane added that he believed Trump should not go back to Butler, Pennsylvania for a planned rally next month, and that the Secret Service should have tried to dissuade the campaign in the lead up to July 13. \n“I strongly suggest that he and his campaign avoid this site on October 5 and in the future,” Crane said."
        }
    ],
    "last_id": 6
}