{"last_id": 1, "entries": [{"id": 1, "title": "Facing GOP attacks, Zelenskyy looks to sell White House on victory", "link": "https://www.politico.com/news/2024/09/25/facing-gop-attacks-zelenskyy-looks-to-sell-white-house-on-victory-00181088", "published": "Wed, 25 Sep 2024 18:16:46 EST", "content": "Ukraine’s president is in the fight of his life. Again. \nVolodymyr Zelenskyy is racing to secure more U.S. military aid — and broader authorization to use Western-supplied weapons — as Russia makes slow-but-steady progress on the battlefield, his country’s energy grid nears the point of collapse, and Ukraine confronts the possibility of the reelection of a hostile Donald Trump. \nAll that makes the stakes of Zelenskyy’s visit this week to the U.S. and the U.N. incredibly high — even for someone Trump derided as “the greatest salesman in history” for his ability to persuade the U.S. to provide aid. \nThe Biden administration will announce new funding for Ukraine but does not appear ready to agree to one of Zelenskyy’s main requests: that the U.S. lifts restrictions on American-made missiles, allowing Kyiv to strike deeper into Russia. \nPresident Joe Biden has been reluctant to grant that request. The administration isn’t convinced it would change the trajectory of the war and believes it could cause Putin to further escalate, according to two senior administration officials. Both were granted anonymity to publicly discuss private deliberations. \nAnd that ask — which has also divided Ukraine’s European allies — appears to be at the centerpiece of the much-hyped “victory plan” that Zelenskyy is expected to present to Biden at the White House on Thursday, according to one of the officials.Zelenskyy is also expected to discuss the plan with Vice President Kamala Harris in a separate meeting Thursday. And he will present it to prominent lawmakers on Capitol Hill, including the top Democrats and Republicans on the Armed Services Committees and the foreign policy committees. \nIn general, much of Washington is still on board with helping Ukraine fend off Russia in a 2 ½-year-old war that has left an estimated 1 million people killed or wounded on both sides. \nThe Biden administration is preparing a few big spending packages for Ukraine, including a $375 million drawdown of U.S. military equipment to send to Kyiv right away, and a $2.4 billion package expected to be announced Thursday while Zelenskyy is visiting the White House. \nThe larger package, confirmed by two U.S. officials granted anonymity to speak publicly about upcoming aid for Ukraine, will be spent on U.S. defense manufacturers to build new weapons and equipment for Ukraine, as opposed to pulling it from existing U.S. stockpiles. \nThe $375 million is part of a remaining $5.9 billion in presidential drawdown authority authorized by Congress in April as part of a wider $61 billion Ukraine aid package. \nA preview of the new funding package came Wednesday. The White House said in a statement following a meeting between Biden and Zelenskyy on the sidelines of the U.N. General Assembly that the U.S. had \"directed a surge in U.S. security assistance to Ukraine, which will help Ukraine win.\"  \nZelenskyy’s appeals to congressional leaders will likely add to the pressure the Biden administration is facing to relax restrictions on Kyiv's use of donated weapons against targets in Russian territory. \nBut there’s also selling for Zelenskyy’s Capitol Hill backers to do. \n“At this point, we need to make the case more strongly to the administration that they need to provide permission for him to strike deeper into Russia. I've been advocating it for weeks and months now. I'm immensely frustrated by the short leash that's been put on Ukraine,” said Sen. Richard Blumenthal (D-Conn.). “And I'm just going to continue pounding and pummeling every official who has anything to do with the decision.\" \nZelenskyy now has to beat back controversy about his Sunday visit to a munitions factory in Scranton, Pennsylvania, where he was flanked by two of the state's vulnerable Democratic lawmakers. House Republicans have opened an investigation into whether taxpayer funds were misused in providing security to the event and Speaker Mike Johnson called on him to fire his ambassador to Washington, Oksana Markarova, over her role in planning the appearance. \nThe timing couldn’t be more delicate for Zelenskyy, as the election looms and a Trump victory calls into question the future of U.S. support for Ukraine. His visit also comes as Russia’s relentless attacks on Ukraine’s energy grid raise the threat of even more hardship for the people of Ukraine. \nUkraine’s supporters on Capitol Hill hope Zelenskyy’s visit could spur a breakthrough on loosening the rules of engagement and give Kyiv a free hand to hit Russian targets with the Army Tactical Missile System and other long-range weapons provided by the West. \n\"The history here is that President Biden has done all the right things, just a little bit later than I would like,” Blumenthal said. “So, there's more than ample reason for hope.\" \nSenate Foreign Relations Chair Ben Cardin (D-Md.), who met with Zelenskyy on the sidelines of the United Nations General Assembly and has urged the White House to approve Ukraine’s use of U.S.-donated weapons to strike deeper inside Russia, said it remains “an active discussion.” \n“So our objective is to keep bipartisan support, and do what we need to do to help him, recognizing that it's a struggle, and he's done incredible things,” Cardin said in an interview. “I think he probably wants to get the [White House’s] sign off on the arms he needs, particularly as relates to defense, longer-range missiles.” \nTop House Republicans, meanwhile, are also putting pressure on the Biden administration to release an unclassified strategy for the war, required by Congress as part of the April aid package. The administration sent lawmakers a classified version, but six House Republican chairs of national security panels argued in a joint statement Wednesday that \"all of Congress and the American people deserve to understand how their hard-earned tax dollars are being spent.\" \nBiden has expressed a commitment to keep helping Ukraine, vowing at his farewell address to the United Nations that he would stand with the war-torn nation. But while U.S. officials are still publicly expressing the belief that Ukraine can fend off Russia, they no longer publicly voice the idea of regaining all its territory.Biden and his inner circle are aware that time may not be on their side, according to the two officials. Biden fears that U.S. aid to Ukraine would likely end if Trump wins in November, destabilizing the conflict and likely emboldening Putin, according to the officials. Still, the president’s aides have long noticed a correlation between high-profile Zelenskyy media moments and a rise in polling support among Americans for Ukraine and hope this week will deliver that again. \nZelenskyy is also drawing Republican fire for an interview with The New Yorker published Sunday, in which he called Trump running mate Sen. JD Vance — who has called for ending U.S. support for Ukraine and for Kyiv to surrender territory to Russia — \"too radical.\" \nSen. Eric Schmitt (R-Mo.) condemned Zelenskyy's actions, saying, \"It's the height of stupidity and arrogance for Zelenskyy to be weighing in on our elections and campaigning for candidates. As Americans, this is our election, and we don't need foreign leaders on U.S. soil interfering and taking sides.\" \nMeanwhile, as the House tackles a stopgap spending patch to avert a government shutdown, Johnson said he didn’t have time to meet with Zelenskyy. \n“I had a very busy schedule this week. If you hadn't noticed,” he told reporters. \nAsked if it would be tougher for Ukraine to secure future U.S. support if Markarova, the Ukrainian ambassador, stays in place, Johnson demurred. \n“I'm not going to even project what any of this may mean, but I do hope that Zelenskyy does the right thing,” he said. “I think it was wildly inappropriate what happened. And we cannot have foreign nations interfering in our elections.” \nAs recently as this weekend, it sounded like Zelenskyy would have a meeting with Trump. But the former president’s campaign now says a meeting is not on the books. In the rally Monday, when Trump called Zelenskyy “the greatest salesman in history” he also said the Ukrainian leader wants Harris “to win this election so badly.” \nStill, some Republican allies of Ukraine are sticking up for its president. Sen. Roger Wicker (R-Miss.) said he hadn’t seen Zelenskyy’s comments about Vance and waved off criticism about the factory visit. \n“It strikes me as appropriate for Americans to realize how many U.S. jobs are involved in manufacturing ammunition and weaponry for Ukraine,” Wicker told reporters. \nAsked about Trump’s characterization of Zelenskyy as a salesman, Sen. Dan Sullivan (R-Alaska) said Ukraine’s fight isn’t about any one individual. Despite early U.S. estimates that Russia would conquer Ukraine within days, Ukrainians never backed down. \n“They stood and fought,” Sullivan said. “That's the most compelling reason, I think why people's support them — not how articulate you may or may not be.”CORRECTION: A previous version of this report misspelled Ukraine President Volodymyr Zelenskyy's name."}]}