{
    "seen_entries": [
        {
            "id": 1,
            "title": "Why JD Vance is absent from key Ohio House campaigns",
            "link": "https://www.politico.com/news/2024/10/08/jd-vance-downballot-races-ohio-00182696",
            "published": "Tue, 08 Oct 2024 04:00:00 EST",
            "content": "TOLEDO, Ohio — Republicans excitedly declared in July that Donald Trump’s decision to pick Sen. JD Vance as his running mate would help them win battleground congressional districts in Ohio. \nThree months later, that doesn’t seem to be playing out in one of the state’s toughest elections — where the GOP is looking for any boost it can get as it tries to oust the longest-serving woman in the House. \nRepublicans had seen Rep. Marcy Kaptur's seat as one of their top pickup opportunities. And several factors went their way this cycle: The party drew a redder district in recent redistricting and they avoided the perils of a candidate with significant personal issues — a critical problem in 2022 that led to Kaptur winning by 13 points. \nThe GOP hoped Vance could give the party the final leg up it needed. At the Republican convention, two days after Trump selected his running mate, House GOP campaign arm Chair Richard Hudson (R-N.C.) said Vance “sets Ohio on fire” and would provide a “real lift” in key House races.But a recent poll had Kaptur with a 10-point lead over Republican Derek Merrin, and the Ohio senator turned vice presidential candidate has barely factored into the matchup. \nVance is conspicuously absent from local billboards that prominently feature Trump, Merrin and GOP Senate candidate Bernie Moreno. He’s not been a part of Republican advertising on broadcast, either, according to a POLITICO review of AdImpact data, despite a plethora of outside spending. And in more than a dozen interviews in the Rust Belt district the day after Vance’s effective debate performance, local voters, politicians and union representatives were either apathetic or outright negative about him. \n“I don't think [Trump and Vance] have very good character. The things they say, like just last night on the debate. … A lot of the things [Vance] was saying, just like Trump, were outrageous and inflammatory,” said Stephanie Garcia, a 55-year-old insurance worker who paused to talk on the streets of downtown Toledo and indicated she supports Kaptur. “Business wise, it might be best for the country, but character is a big deal for me.” \n“I literally have members who told me: ‘I'm voting for Trump, but I'm splitting the ticket. I'm going to vote for Marcy, and I'm going to vote for Sen. [Sherrod] Brown.’ Because they see them in action,” said UAW Local 14 President Tony Totty. \nEven for voters who support Merrin and Trump, Vance hadn’t factored into their decision. He was largely unknown to some before the debate. \n“I didn't really know anything about [Vance], even though we're both from Ohio, but I thought he really did good [in the debate],” said Darlene Fisher, standing outside of a Kroger grocery store. She was supporting Merrin because “Marcy's been in there too long. I know her personally. She needs to retire.” \nWhile GOP leaders had crowed about Vance after Trump picked him in July, rank-and-file Republicans more quietly expressed fears that he didn’t bring much to the ticket as a senator from a solid-red state with a political worldview similar to Trump's. And if Republicans aren’t using Vance as an asset here in Toledo, it begs the question: Where does he help the party this cycle?Kaptur has embraced a now-viral clip that concerns Vance from last year’s UAW strike — when she quipped at him at the picket line: “First time here?” Besides that, Kaptur is steering clear of the vice presidential candidate and trying to keep the highly partisan national atmosphere out of her campaign. \nRecalling that moment in an interview after finishing an event at the Lucas County Commission offices, Kaptur grew animated: “What does he know about the auto industry and the trucking industry?” \nKaptur has defied political gravity in a district that favored Trump by 3 points in 2020 by keeping close ties at the local level. She’s represented the area for over forty years, and signs of her influence are everywhere. She spoke with POLITICO next to a display in a local county office dedicated to “Lucas County’s Wall of Friends” — where Kaptur was prominently featured.Just a day after the vice presidential debate and Vance’s strong performance, Kaptur shrugged off any effect he’d have down-ballot: “I think he has high ambitions, and so he's been successful in getting elected in Ohio, but he hasn't had time, really to have any results.” Vance was first elected to the Senate two years ago and built a career largely outside of politics before that. \nAnother point working against Republicans: Democrats’ switch at the top of the presidential ticket over the summer negated a lot of their extreme top-of-the-ticket liability. A late-July survey after President Joe Biden dropped out of the race showed Trump and Harris basically tied in the district, while Biden had a favorable rating of just 36 percent and a 60 percent unfavorable rating. Vance, who narrowly lost the district in his 2022 Senate race, had a 48 percent unfavorable rating.  \nStill, Republicans project confidence about the district moving in their direction. Ticket splitting between presidential and House candidates is always a tough swing, and at least some of Kaptur's 2022 victory is attributable to flawed GOP candidate J.R. Majewski. \n\"After 41 years in Congress with almost nothing to show for it, Marcy Kaptur has left Ohioans behind and Derek Merrin is strategically positioned to capitalize on the Trump/Vance momentum — flipping this seat red and ending Kaptur's tenure of inaction,\" said Mike Marinella, a spokesperson for House Republicans' campaign arm.Merrin declined an interview request for this story. He instead sent a statement, saying he was running “to bring the fresh leadership Northwest Ohio needs to fight for those in our community who are truly hurting due to the skyrocketing inflation of the Biden/Kaptur economy. I'm proud to support the Trump/Vance ticket because their economic policies are going to put the American people first and bring back the American dream.\" \nVance spokesperson William Martin said in a statement that Ohio Republicans are \"energized\" and that they're confident voters will elect Trump, Moreno and Merrin in November. He added that \"Senator Vance is laser focused on making sure we elect President Donald Trump back to the White House, and he is barnstorming the country in order to take our America First message directly to voters.\" \nAnd it's not just in this district that Vance is a non-issue. He hasn't popped up as a surrogate for Moreno in the Senate race, nor is he a presence in the state's other competitive congressional race in Northeast Ohio, where first-term Democratic Rep. Emilia Sykes is seeking a second term. \nSome Republicans defended the party's lack of focus on Vance, saying that with Ohio sliding toward Trump, the senator's time would be better served in more competitive swing states. \n“He's got a lot on his plate,” said Republican state Rep. Josh Williams, who represents a Toledo-area district. “He’s been here advocating for change here in Ohio. I believe that there's enough momentum here in Ohio for a true shift in politics here.” \nMuch of Merrin’s argument against Kaptur has centered around the common battleground theme of immigration, and Republicans have also used the career-politician criticism against her in ads. “Marcy Kaptur has been in Congress for 40 years, 40 years of voting for open borders,” declared a recent National Republican Congressional Committee spot.Kaptur, like many purple-district Democrats this cycle, pointed to the bipartisan border bill torpedoed by Republicans this Congress as part of the work she and other lawmakers had done to address a surge in migration at the southern border. And she embraces her lengthy tenure in Congress head-on. \n“I think one of the problems the country is having right now is people don't stay in elected office long enough,” she said, pointing to long-term problems facing the region like water quality in the Great Lakes or rail infrastructure. “We have to have people who are experienced, and I just think that people have to dedicate their lives to the Republic, to their communities. ... We can't have green people being elected at every level who come with no experience in governance.” \nHer longevity has given her a boost in name recognition, though that could also cut against her. The seniority issue elicited strong opinions from voters. Robert Voltz, a 42-year-old Jeep worker out walking his dog who said he was undecided on the House race, said: \"I know who Marcy is. I don’t know who her opponent is.” And Susan Hinkel offered an expletive for Kaptur as she left Kroger, adding: “Time for her to go home.” \nThe 78-year-old Kaptur isn't giving any hints about her future retirement plans if she wins reelection. \n“I don't know that answer, but the seniority I hold belongs to the people I represent,” she said. \"They stuck with me through thick and thin, and I hope they'll say the same about me someday, that I stuck with them through thick and thin.”"
        },
        {
            "id": 2,
            "title": "Mike Lee lays out demands for McConnell successor",
            "link": "https://www.politico.com/news/2024/10/07/mike-lee-demands-senate-gop-leader-00182805",
            "published": "Mon, 07 Oct 2024 21:21:05 EST",
            "content": "The leader of an effort among conservative senators to shape the race to elect the next Senate GOP leader — and push the chamber further right — is finally putting his ideas down on paper. \nSen. Mike Lee (R-Utah) on Monday night laid out a series of proposals meant to decentralize power inside the Senate Republican Conference, taking it away from the office that outgoing Leader Mitch McConnell has occupied for nearly two decades. \nIn a letter sent to Senate Republican offices Monday night and obtained by Playbook, Lee doesn’t explicitly refer to his proposals as demands. But in the context of a hotly contested race to succeed McConnell between Sens. John Cornyn (R-Texas), John Thune (R-S.D.) and Rick Scott (R-Fla.), the list will clearly be seen as a roadmap for winning the support of the roughly dozen conservative senators whom Lee is believed to be speaking for. \n“We have the chance to strengthen the Senate, empower individual members, and ensure that the voices of the American people are heard once more,” Lee wrote. \nThe proposals largely have to do with Senate and GOP Conference procedures, not with particular policies. In that respect, they are similar to the demands that the hard-right House Freedom Caucus made last year ahead of Kevin McCarthy’s election as House speaker. \nMcCarthy indulged those demands to win election, including giving conservatives de facto control of the floor through prized spots on the House Rules Committee, and he immediately found it difficult to govern effectively. A small cadre of hard-liners forced him out nine months later. \nThe Senate has traditionally been more collegial, and more respectful of individual lawmakers’ rights. But frustration has grown over the past two decades as more and more power has been centralized in the party leadership suites, and conservatives have blamed that centralization for bipartisan deals that they despise. Lee has taken to calling it “uniparty” rule. \nWhile Scott is seen as the most solicitous of conservatives in the race to succeed McConnell, his broader support is seen as limited. The more likely scenario is that the conservative bloc becomes a possible kingmaker in a second-ballot race involving Cornyn and Thune, who are seen as more natural heirs to McConnell’s leadership style. \nLee’s proposals can be seen as an initial bid to exert leverage in such a scenario. His ideas include: \n \n Requiring three-fourths of the Conference to agree before the leader can “fill the tree,” an increasingly frequent procedural maneuver by which a majority leader can effectively shut down potential amendments. “This would give individual members more say and restore the Senate as a place of genuine debate and negotiation,” said Lee, who has long pushed for a more open amendment process — along with many other senators of both parties. \n Require four weeks of debate and amendment for omnibus appropriations bills, the catchall packages that leaders tend to hash out behind closed doors then push through the House and Senate with minimal time for review or debate. “We know when the funding deadlines are; we set them,” wrote Lee. “We should have no problem setting a schedule for consideration four weeks in advance of that deadline.” \n Create a “floor schedule” at the outset of the legislative year for appropriations and stick to it — so that the chambers can fully debate and amend spending bills rather than consider them in a rush during the holidays, as has become customary. \n Confine the GOP whip to muscling votes only for positions that have majority support from the Republican Conference. Such a rule, Lee said, “would protect Republican leadership from ever being in the position of having to whip for legislation advancing Democrat priorities, as happens from time-to-time when must pass legislation is up against a critical deadline.” \n Lastly, propose “policy goals” and “specific strategies” to achieve them that Republicans should aim for during high-stakes negotiations — a nod to conservatives’ belief that they too often get rolled on priorities such as the debt ceiling and spending caps. Laying those out in advance, he wrote, “would give us a shared vision to rally around.” \n \nLike this content? Sign up for POLITICO's Playbook newsletter. "
        },
        {
            "id": 3,
            "title": "‘A temper tantrum from a deranged fanatic’",
            "link": "https://www.politico.com/news/2024/10/06/tom-cotton-jack-smith-trump-00182629",
            "published": "Sun, 06 Oct 2024 11:51:51 EST",
            "content": "On Wednesday, a federal judge unsealed special counsel Jack Smith’s 165-page legal brief detailing Republican presidential nominee Donald Trump’s alleged criminal activities related to the Jan. 6 Capitol riot. On Sunday, Arkansas Sen. Tom Cotton called the move “a temper tantrum from a deranged fanatic” on NBC’s “Meet the Press.” \n“This is unverified, un-cross-examined hearsay from grand jury testimony, which usually isn't revealed publicly for that reason,” Cotton (R-Ark.) told “Meet the Press” host Kristen Welker. “He went to court. He asked for special permission to file a brief that's four times as long as a normal brief and to have it disclosed less than 30 days before the election. This is professional misconduct in all likelihood by Jack Smith and it should be investigated.” \nIn Smith’s legal brief, he argued that Trump is not immune from charges of orchestrating multiple criminal conspiracy theories, despite the Supreme Court’s ruling over the summer that granted presidents broad immunity for official acts. \"Although the defendant was the incumbent president during the charged conspiracies, his scheme was a fundamentally private one,” Smith and his team wrote in detailing the evidence collected. \nCotton emphasized that Trump did not incite violence at the riots, instead telling protesters to be peaceful and patriotic. He said that Smith’s assertions are “unverified, un-cross-examined hearsay.”“This is a perfect example of actual election interference, Jack Smith violating Department of Justice regulations to try to get out as much unverified so-called evidence as he has because he's angry that he lost and the Democrats don't think they can beat Donald Trump on issues like inflation and immigration,” Cotton said. \nOne point from the Smith case filings was that Trump told his daughter and son-in-law, “It doesn’t matter if you won or lost the election. You still have to fight like hell,” according to a Trump White House aide who overheard him. \nWhen asked if Cotton would definitively say that Trump lost the 2020 election, Cotton said that President Joe Biden was elected president in 2020 but called it an unfair election. \n“You had states that were changing their election practices or election laws, sometimes in violation of the Constitution,” he said. “You had networks combining with big tech to suppress what we now know to be a truthful story about Hunter Biden's laptop and the evidence that it exposed about Biden family corruption.” \nCotton added: “Everything has gone to hell in a handbasket as a result of it,” citing inflation, rising and immigration rates."
        },
        {
            "id": 4,
            "title": "Senate Republicans’ strangely uneven spending map",
            "link": "https://www.politico.com/news/2024/10/06/senate-republican-ad-spending-map-uneven-00182625",
            "published": "Sun, 06 Oct 2024 11:21:19 EST",
            "content": "Senate Republican spending is heavily concentrated in just a handful of races — a distribution that doesn’t match the reality of the battleground map. \nThat dynamic is the result of poor fundraising from some key candidates and the party’s reliance on fickle big donors to close the gap. The playing field is ripe with inviting targets, but the advertising from the GOP and its allies is heavily lopsided instead of spread across them. And some of the places where they’re more involved are not the most obvious pickup opportunities. \nInstead, a combination of individual candidate strengths and weaknesses, donors’ preferences, and targeting by special interests has created a highly uneven playing field and a clear picture of a party that's fallen badly behind in individual fundraising. \nAmong the disparities: \n \n Republicans and their allies are spending more money in a single state, Pennsylvania, than in Michigan, Wisconsin and Arizona combined. \n In fact, the GOP is spending 2.3 times as much to help former hedge fund CEO Dave McCormick oust a strong Democratic incumbent in Pennsylvania as in Michigan, a similarly purple state that has an open seat. \n More money is going into defending Sen. \n    Ted Cruz \n  ’s Texas seat, which is considered in play but not highly at risk, than in three Senate races in presidential battlegrounds. \n In Arizona, Rep. \n    Ruben Gallego \n   (D-Ariz.) alone is spending more than all the Republican advertisers, including outside groups, combined. \n GOP super PACs and mega-donors are putting more money into former Gov. Larry Hogan’s uphill Senate bid in blue-leaning Maryland than in the Sun Belt targets. \nNational Republicans would love to seriously contest all of their eight top offensive battlegrounds, and party leaders didn’t set out to create such a heavily uneven map. But races don’t just attract money based on how winnable they are. \n“In the case of McCormick and Hogan there are personal reasons why they are attracting the kinds of outside spending that they are,” said Scott Jennings, a longtime adviser to Senate Minority Leader Mitch McConnell. For example: “I know this person, or I love the kinds of politics that Larry Hogan represents.” \nBoth parties are still pouring money in for the final weeks of the campaign, and a top Senate GOP super PAC has committed millions of dollars in recent days to help close the gap in the Midwest. The price to air ads fluctuates widely state by state, and Pennsylvania is among the most expensive, justifying some of the heavy price tag there.  \nStill, the shocking disparities could heavily influence Republicans’ success in November — and raise questions about the size of the majority they’re pursuing. \nRepublicans need to flip only two seats to guarantee control of the Senate, and they already have one, West Virginia, in the bag. Their prime targets, the red states of Montana and Ohio, are fully funded: There’s virtually no air time left for super PACs in Montana. In Ohio, allies of Republican Bernie Moreno are already outspending Democrats by more than $40 million, thanks in part to a $30 million investment by a crypto industry super PAC. \nIf Republicans can win either of those seats, ousting Sen. Jon Tester in Montana or Sen. Sherrod Brown in Ohio, Senate control is almost certainly theirs. But they entered the cycle eager to flip a slew of other battleground states, including Pennsylvania, Wisconsin, Arizona and Nevada — all places Donald Trump is contesting and energizing the GOP base. They even landed a star recruit who single-handedly put Maryland in play. \nBut Democratic spending has been overwhelming in some key states. \nIn Nevada and Arizona especially, the GOP has a more than two-to-one spending deficit, and some party operatives are privately feeling increasingly dismal about their prospects. And the donor dollars flowing into a blue state like Maryland or against a veteran incumbent like Sen. Bob Casey in Pennsylvania underscores the disconnect between donors’ preferences about candidates and other states that may be more primed to flip. \n“Donors don't think like political strategists. They think like donors. And they try to shape where the party is going,” said one Republican operative involved in Senate races, granted anonymity to speak candidly about financial motivations.Pennsylvania: Republican money pours into helping a former hedge fund CEO oust a tough incumbent \nPennsylvania, a highly competitive swing state, was always going to be a top Senate race. \nAnd McCormick was a prized recruit for the GOP. As the former CEO of one of the world’s largest hedge funds, he has impeccable connections in the finance industry. He’s helped some of the party’s donors grow their wealth during his time on Wall Street, and now they are giving him a major boost. \nHis allies started a super PAC, Keystone Renewal, funded by a nearly comprehensive list of GOP mega-donors, from the Ricketts to the DeVoses to the Uihleins. As of Oct. 2, it had spent more than $42 million on the Senate race. \nMeanwhile, the Senate Leadership Fund, the GOP super PAC closely aligned with McConnell, is spending more than $45 million on ads for McCormick. The outside spending has propelled pro-McCormick advertising in the state to a massive $113 million from Labor Day to Election Day. \nDemocrats, in comparison, are spending a collective $81.6 million during that period, with $21 million of that coming from Casey’s campaign. \nRepublicans know McCormick will need every possible minute of advertising to get his message out in Pennsylvania on the crowded and pricey airwaves during a presidential election year. \nThe son of a former governor, Casey has won six statewide elections in his career. First elected to the Senate in 2006, he won his three races by double-digits or close to it. Even some Republicans acknowledge he is “political royalty” in the state and will be hard to beat. \n“Casey's tough to knock off. I've known him for 30 years,” Rep. Dan Meuser (R-Pa.) said. Casey could be dragged down by his association with national Democrats, he said, but McCormick will still need as much money as he can amass: “Outside of that he's a really nice guy, and that's how Pennsylvania perceives him. So Dave's got to really crack it to win.” \nSun Belt: Democrats are drowning Republicans in TV spending, and it’s even worse than it looks at first \nOther states that on paper look like better offensive targets than Pennsylvania have received only a sliver of that kind of spending. \nConsider Nevada: First-term Sen. Jacky Rosen and her allies are outspending Republican Sam Brown and his supporters by a more than 2:1 ratio from Labor Day on, $45 million to $19 million. Brown has booked only $3 million in ad buys from his campaign compared to Rosen’s $12.5 million. \nHidden behind the overall TV spending numbers is a reality even worse for Republicans in many states. \nCandidates can purchase TV ad time at cheaper rates, sometimes significantly discounted, than super PACs or outside groups. But most Republican candidates are raising far less and relying heavily on super PACs to close the gap — meaning much of the pro-GOP spending is far less efficient, seen by fewer voters for every dollar spent. \nDemocratic Senate candidates have been raising gargantuan sums of money that they’re then able to put into the airwaves. In Ohio, Brown announced last week that he hauled in $30.6 million in the third quarter. Rep. Elissa Slotkin, who is running for Michigan’s open seat, brought in $18 million. Gallego raised more than $21 million in Arizona. \nGallego’s campaign alone has spent or reserved nearly $25 million from Labor Day onward, part of a stunning advertising gap: Democrats have booked $65.7 million, and Republican Kari Lake and her allies have only $23 million. \n“It pretty much shows you sort of where the political market believes this race is going,” Kirk Adams, a Republican former Arizona state House speaker, said of the lack of spending by GOP groups. “The real metric to look at is the money they put into Arizona versus the money they put into other contested races. And that probably tells you your story right there.” \nLake, who ran a fire-and-brimstone MAGA-focused race for governor in 2022, has not endeared herself to some key names in the GOP establishment. \n“Republicans on the ground here are feeling more optimistic about almost every other race, including legislative races,” Adams said. “That optimism does not include the Senate race.” \nMaryland: GOP donors pour money into an uphill battle \nHogan’s Maryland Senate bid is among the most well-supported, with $30 million in GOP TV spending after Labor Day. Democrats are at $17 million. \nHogan’s air domination is powered by the Maryland’s Future super PAC, which is flush with cash from many of the same names that seeded McCormick’s PAC. That group has dropped more than $19 million on ads so far. \nThat means more GOP dollars are being spent in Maryland, a state that Joe Biden won by more than 30 points in 2020, than in the presidential battlegrounds of Nevada or Arizona. \n“You see opportunities there in Maryland that I think are real,” Sen. Thom Tilis (R-N.C.) said. “I think it's smart. They're looking at analytics and making decisions that are the right decisions so far.” \nOther Republicans are also leaning on bespoke super PACs formed to aid them, though Hogan’s and McCormick’s are more well-funded. Tim Sheehy in Montana and former Rep. Mike Rogers in Michigan also have dedicated outside groups supporting their Senate bids. That allows donors to cut large checks to help a specific candidate, but it also means less control for groups like the Senate Leadership Fund, which is meant to be a party clearinghouse and can direct resources more strategically across the country. \n\"The decentralization of Republican fundraising is a real thing that is happening, and it will happen even more next cycle,\" said one GOP strategist involved in Senate races, granted anonymity to speak candidly. \"It incentivizes candidates to build their own ecosystems.\""
        },
        {
            "id": 5,
            "title": "Johnson won't condemn Eric Trump comments blaming Dems for assassination tries",
            "link": "https://www.politico.com/news/2024/10/06/johnson-trump-democrats-assassination-attempts-00182619",
            "published": "Sun, 06 Oct 2024 10:24:24 EST",
            "content": "Speaker of the House Mike Johnson refused Sunday to condemn comments from former President Donald Trump and his family that suggest Democrats were behind assassination attempts on Trump. \n“I don't think they're saying that the Democratic Party tried an assassination attempt. I think what they're alluding to is what they've all been saying. They have got to turn the rhetoric down,” Johnson said in an interview with host George Stephanopoulos on ABC’s “This Week.” “For years now, the leading Democrats in this country, the highest elected officials and the current nominee for president have gone out and said that Donald Trump is a threat to democracy, that the republic will end if he's reelected.” \nJohnson said he needed more context since he had not watched the rally Saturday in Butler, Pennsylvania — and instead deflected to talking about the “massive crowd” that Trump was pleased with. But the speaker added that Democrats calling Trump a “threat to democracy” is “absolute nonsense, and they have incited dangerous people to do dangerous things.” \n“We need everybody on all sides to turn the rhetoric down and let's have a debate about the records of these candidates, not the rhetoric,” Johnson added. “Let's talk about the policies, not the personalities.” \nStephanopoulos pressed Johnson on whether he supported comments that Eric Trump, the former president's son, made at the Butler rally. “They tried to smear us. They came after us. They impeached him twice, and then, guys, they tried to kill him. They tried to kill him, and it's because of the Democratic Party. They can't do anything right,” Eric Trump said at the rally.  \nThe host also asked what other context Johnson could need and if this counts as that type of rhetoric. \n“I'm not going to parse the language of what people say at rallies,” Johnson said. “I could give you pages and pages of crazy comments by the leading Democrats in this country. That's not what this is about.” \nJohnson, a former constitutional lawyer, was also one of the architects in the House behind arguing against certifying the 2020 election results before he was speaker. When asked if he could say unequivocally that President Joe Biden won the 2020 election — after Trump’s running mate JD Vance declined during the vice presidential debate to say if Biden won — Johnson deflected. \n“This is the game that is always played by mainstream media with leading Republicans. It's a gotcha game,” Johnson said. “You want us to litigate things that happened four years ago when we're talking about the future. We're not going to talk about what happened in 2020. We're going to talk about 2024, and how we're going to solve the problems for the American people.” \nStephanopoulos added that Trump regularly states he won the 2020 election and baselessly claims that it was rigged. \n“I'm the speaker of the House. I work with the president of the United States all the time. Joe Biden has been the president for four years,” Johnson said. “There's not a question about this, OK? It's already been done and decided, and this is a gotcha game that's played and I'm not playing it.” \nAs for what Johnson will do on Jan. 6 of 2025 — if he is speaker and Kamala Harris has won the election — Johnson said he is going to “follow the Constitution.” \n“Article 2 of the Constitution is clear. Congress has a specific role, and we must fulfill it,” Johnson said. “I've made a career defending the Constitution. I always have, and I've demonstrated over and over that we are going to do the right and lawful thing. So you can count on that. We're going to do our job.” \nLater on Sunday, Johnson responded with a clip from the interview on X, and criticized Stephanopoulos for not asking any questions about Hurricane Helene, immigration or the economy. \"No wonder no one trusts the media,\" Johnson wrote."
        },
        {
            "id": 6,
            "title": "Supreme Court to take up Mexico’s lawsuit against US gunmakers",
            "link": "https://www.politico.com/news/2024/10/04/supreme-court-mexico-guns-lawsuit-00182534",
            "published": "Fri, 04 Oct 2024 11:35:09 EST",
            "content": "The Supreme Court has agreed to decide whether the government of Mexico can sue the leading gun manufacturers in the U.S. for allegedly fueling drug cartel violence south of the border. \nThe justices announced Friday that they will hear the gunmakers’ challenge to an appeals court ruling that would allow the unusual, $10 billion lawsuit to proceed in federal court in Boston. \nA district court judge threw the case out two years ago, citing a 2005 law Congress passed to block an increasing number of suits seeking to hold gun manufacturers liable for violence and deaths involving firearms. \nHowever, the Boston-based 1st Circuit Court of Appeals in January said the suit could proceed because the Protection of Lawful Commerce in Arms Act was aimed solely at limiting suits over the domestic market in weapons and because Mexico had alleged that the companies’ conduct amounted to “aiding and abetting” gun smuggling. \nMexico contends in its suit that over a half million firearms a year made in the U.S. wind up in Mexico, often reaching drug trafficking cartels. The illicit flow of weapons undercuts Mexico’s strict gun laws, the suit claims. \nThe suit, which targets major U.S. gunmakers including Smith &amp; Wesson, Glock, Colt and Beretta, claims that the companies’ distribution, sales and marketing practices encourage sales to so-called “straw” buyers, who often bring the guns to Mexico or furnish them to others who do. \nThe gunmakers asked the Supreme Court to take up the case, arguing that it amounts to a backdoor effort to impose gun regulations Congress hasn’t passed or has allowed to expire, such as the assault weapons ban that was in effect from 1994 to 2004. \n“Mexico makes no secret that it abhors this country’s approach to firearms, and that it wants to use the American court system to impose domestic gun controls on the United States that the American people themselves would never accept through the ordinary political process,” the companies’ attorneys wrote. \nThe firearms manufacturers also say the suit is flawed because those who traffic the weapons into Mexico are committing “multiple independent criminal acts” that don’t involve the companies. \nThe gun-related case was included Friday on a broader list of cases the Supreme Court announced it would take up in its upcoming term, which begins Monday. Other cases the justices agreed to hear include a dispute about permits to store nuclear waste in west Texas, a criminal false statements case involving former Chicago Mayor Richard J. Daley’s nephew, and a legal fight related to the Food and Drug Administration’s power to regulate vaping. \nThe newly added cases are likely to be scheduled for argument early next year. \nIn separate orders Friday, the Supreme Court turned down an effort by power companies to block a Biden administration rule to limit emissions of mercury and other toxic metals from power plants, and the court rejected a bid from Republican-led states to halt a rule to reduce methane emissions during energy production. No justice noted any dissent from either order."
        },
        {
            "id": 7,
            "title": "Capitol police chief: New intel bureau is key as Congress threats rise",
            "link": "https://www.politico.com/video/2024/10/03/capitol-police-chief-new-intel-bureau-is-key-as-congress-threats-rise-1456906",
            "published": "Thu, 03 Oct 2024 15:33:12 EST",
            "content": "Capitol police chief: New intel bureau is key as Congress threats rise \nlead image"
        },
        {
            "id": 8,
            "title": "Johnson slams Biden-Harris admin for ‘hypocritical’ Israel stance",
            "link": "https://www.politico.com/news/2024/10/01/johnson-slams-biden-harris-admin-hypocritical-israel-stance-00181963",
            "published": "Tue, 01 Oct 2024 17:23:34 EST",
            "content": "Johnson slams Biden-Harris admin for ‘hypocritical’ Israel stance"
        },
        {
            "id": 9,
            "title": "Biden: Congress 'may have to' come back to approve Helene relief",
            "link": "https://www.politico.com/video/2024/09/30/biden-congress-may-have-to-come-back-to-approve-helene-relief-1450967",
            "published": "Mon, 30 Sep 2024 11:33:15 EST",
            "content": "Biden: Congress 'may have to' come back to approve Helene relief \nlead image"
        },
        {
            "id": 10,
            "title": "Rubio defends Trump's approach to Russia-Ukraine war",
            "link": "https://www.politico.com/news/2024/09/29/marco-rubio-trump-ukraine-russia-war-00181570",
            "published": "Sun, 29 Sep 2024 11:39:26 EST",
            "content": "Sen. Marco Rubio (R-Fla.) defended GOP presidential nominee Donald Trump saying the Russia-Ukraine war must end through negotiation in an interview Sunday rather than counting on a Ukrainian victory. \n“I'm not on Russia's side — but unfortunately the reality of it is that the way the war in Ukraine is going to end is with a negotiated settlement,” Rubio said in an interview with Kristen Welker on NBC’s “Meet the Press.” “And I want, and we want, and, I believe Donald Trump wants, for Ukraine to have more leverage in that negotiation.” \nRubio, vice chair of the Senate Intelligence Committee, said he didn’t know “why we can’t just say that” in regards to Trump’s proposed negotiated deal.  \nOn Wednesday, Trump gave one of his strongest signals so far that he will not fully back Ukraine's aims, saying Ukraine should have “given up a little bit” at a campaign event in North Carolina. On Friday, after meeting with Ukrainian President Volodymyr Zelenskyy, Trump supported a negotiated deal, saying, \"It takes two to tango, and we will.\" And when asked directly, the former president denied two opportunities to say he wanted Ukraine to win during the last presidential debate against Vice President Kamala Harris. \nZelenskyy and Ukraine's supporters have insisted that all of Ukraine's occupied territory must be restored. But Rubio added that the Biden administration, if pressed on what victory looks like for Ukraine, would also agree that a negotiation is the end result. \n“We hope that when that time comes there is more leverage on the Ukrainian side than on the Russian side. That really is the goal here in my mind,” Rubio said. “And I think that's what Donald Trump is trying to say, but he's going to say it like a businessman. But Biden won't even tell us what victory is.” \nThe Florida senator also danced around supporting Republican vice presidential nominee JD Vance for saying that a peaceful settlement could look like “the current line of demarcation between Russia and Ukraine, that becomes like a demilitarized zone” on a podcast recently. \n“I think what the deal looks like will be up to the parties when they negotiate it. Obviously, Zelenskyy is not going to come out there and say, from a negotiating standpoint is not going to go out there and predetermine what it looks like,” Rubio said. “So I understand why he wouldn't want to go out there and define what it looks like at the front end.” \nHe added, “But I think we, as Americans, the reality of it is we are investing billions of dollars into this effort, and it's important that as we invest this money into this effort that we tell the American taxpayer, ‘This is what the money's going toward.’ Ultimately, it's not endless war, right?” \nWhen pressed on whether he would be comfortable with accepting the demarcation agreement Vance proposed, Rubio dodged, saying he would be comfortable with a negotiated deal that ends hostilities and favors Ukraine, “meaning that they have their own sovereignty.” He reiterated that he would not “prejudge any agreement” when asked if that means he did not support Vance’s claims. \n“The most important thing here is that these hostilities end and that Ukraine can go back to rebuilding its economy and people can move back. Millions of people have had to leave that country,” Rubio said. “It's been devastating to them. But that negotiation is going to be up to them. I just want them to have more leverage than Putin.”"
        }
    ],
    "last_id": 10
}