{
    "seen_entries": [
        {
            "id": 1,
            "title": "Trump shooting task force emphasizes Secret Service failures in first hearing",
            "link": "https://www.politico.com/live-updates/2024/09/26/congress/secret-service-failures-trump-shooting-task-force-00181240",
            "published": "Thu, 26 Sep 2024 13:26:13 EST",
            "content": "The Secret Service didn’t testify Thursday before a House task force investigating the two assassination attempts against former President Donald Trump. But it’s the main focus of the panel’s first public hearing. \nThe House panel used a hearing with state and local law enforcement, as well as a former Secret Service official, to drill down into the decisions made in the lead-up to and during the July 13 shooting at Trump’s rally in Butler, Pennsylvania. \nRep. Mike Kelly (R-Pa.) set the tone during his opening statement, saying the shooting was not prevented “because of failures by the Secret Service.” \n“The Secret Service was not assertive on key decisions,” Kelly said, comparing communications and messages through the various layers of law enforcement to “the old children’s game, telephone.” \nState and local law enforcement officials described a lack of communication and guidance from the Secret Service, and said the agency appeared to lack key resources during the event. John Herold, who is with the Pennsylvania State Police, contrasted the resources for a Trump 2020 rally with the event earlier this year. \n“The Secret Service did not have a lot of the resources that were in Butler for 2020, and this event on July 13 they seemed like they had a lot less resources,” Herold said. \nThe task force heard from two other local law enforcement officials who were in Butler on July 13: Drew Blasko and Edward Lenz, as well as Ariel Goldschmidt, the Allegheny County medical examiner, and Patrick Sullivan, a former Secret Service agent. \nThe officials were grilled on what communications they had with the Secret Service ahead of the rally. Both Lenz and Herold told the panel that they did a walk through of the rally site with the Secret Service in advance of July 13. The agency did not bring up how to secure the building where the gunman, Thomas Crooks, was able to access the roof, the witnesses said. \nLenz also told the committee that local law enforcement snipers didn’t receive guidance from the Secret Service about how to cover the building where the gunman ultimately was, and that he did not believe Secret Service agents could hear their radio communications on that day. The law enforcement officials also told the committee that they were not made aware of foreign threats against Trump, a reference to Iranian assassination threats. \nLenz also told the committee that, at 6:11 p.m., he ordered a quick-reaction force to deploy to the building where the gunman was and, prior to finishing that transmission, “you can hear the shots being fired through my open microphone.” \nThe task force has until mid-December to wrap up its work and issue a report on its findings and recommendations to prevent future violence against candidates. Its purview now also includes the second attempted assassination against Trump in West Palm Beach, Florida. The task force was expected to travel to Florida on Friday, but the trip was canceled as the state braces for Hurricane Helene. \nThe hearing comes a day after a Senate committee released an interim report that found sweeping errors by the Secret Service in the lead-up to and during the July 13 rally. \nReps. Eli Crane (R-Ariz.) and Cory Mills (R-Fla.) also testified to the committee on Thursday. The two GOP lawmakers have been part of a group of House Republicans who have been running their own investigation into the July 13 shooting after they weren’t tapped by leadership to join the task force. Unlike the task force, they do not have subpoena power, but said they would share any information they get with the House panel. \nCrane, during his statement, said that they believe then-Secret Service Director Kimberly Cheatle lied when she testified before Congress earlier this year about why law enforcement was not placed on the roof, where Crooks ultimately fired his shots. \nCrane added that he believed Trump should not go back to Butler, Pennsylvania, for a planned rally next month, and that the Secret Service should have tried to dissuade the campaign in the lead-up to July 13. \n“I strongly suggest that he and his campaign avoid this site on Oct. 5 and in the future,” Crane said."
        }
    ],
    "last_id": 1
}